In [1]:
import numpy as np
import pandas as pd

### Pivot Tables

In [3]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South','East', 'West', 'North', 'South','East', 'West', 'North', 'South','East', 'West', 'North', 'South','East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['Jhon', 'Mary', 'Bob', 'Alice','Jhon', 'Mary', 'Bob', 'Alice','Jhon', 'Mary', 'Bob', 'Alice','Jhon', 'Mary', 'Bob', 'Alice','Jhon', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)
df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    496     22   Jhon  January      Q1
1  2023-01-02       B   West    967     50   Mary  January      Q1
2  2023-01-03       C  North    886     94    Bob  January      Q1
3  2023-01-04       D  South    278     92  Alice  January      Q1
4  2023-01-05       A   East    952     72   Jhon  January      Q1
5  2023-01-06       B   West    489     40   Mary  January      Q1
6  2023-01-07       C  North    623     78    Bob  January      Q1
7  2023-01-08       D  South    324     48  Alice  January      Q1
8  2023-01-09       A   East    490     87   Jhon  January      Q1
9  2023-01-10       B   West    455     35   Mary  January      Q1
10 2023-01-11       C  North    625     30    Bob  January      Q1
11 2023-01-12       D  South    756     12  Alice  January      Q1
12 2023-01-13       A   East    193     20   Jhon  January      Q1
13 2023-01-14       B   West    992     85   Mary  January      Q1
14 2023-01-15       C  North    588     57    Bob  January      Q1
15 2023-01-16       D  South    768     44  Alice  January      Q1
16 2023-01-17       A   East    972     14   Jhon  January      Q1
17 2023-01-18       B   West    773     88   Mary  January      Q1
18 2023-01-19       C  North    408     65    Bob  January      Q1
19 2023-01-20       D  South    647     60  Alice  January      Q1

In [13]:
#Pivot Tables used for aggregation purpose
pd.pivot_table(df, values='Sales', index='Region', columns='Product') #Default mean

Product      A      B      C      D
Region
East     620.6    NaN    NaN    NaN
North      NaN    NaN  626.0    NaN
South      NaN    NaN    NaN  554.6
West       NaN  735.2    NaN    NaN

In [8]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product', aggfunc= 'median')

Product      A      B      C      D
Region
East     496.0    NaN    NaN    NaN
North      NaN    NaN  623.0    NaN
South      NaN    NaN    NaN  647.0
West       NaN  773.0    NaN    NaN

In [9]:
pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product') #values must be numerical

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     620.6    NaN    NaN    NaN  43.0   NaN   NaN   NaN
North      NaN    NaN  626.0    NaN   NaN   NaN  64.8   NaN
South      NaN    NaN    NaN  554.6   NaN   NaN   NaN  51.2
West       NaN  735.2    NaN    NaN   NaN  59.6   NaN   NaN

### Cross Tabs

In [11]:
pd.crosstab(df['Region'], df['Product']) #Cross tab used for counting purpose

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0